aroyer-qc/GRBL_Digini_STM32Fx/module/Digini/Grafx/src/driver/STM32F4xx/lib_STM32F4_lcd_240x320.cpp
//-------------------------------------------------------------------------------------------------
//
//  File : lib_STM32F4_lcd_240x320.cpp
//
//-------------------------------------------------------------------------------------------------

//-------------------------------------------------------------------------------------------------
// Include file(s)
//-------------------------------------------------------------------------------------------------

#include "digini_cfg.h"
#ifdef DIGINI_USE_GRAFX
#include "stm32f4xx.h"
#include "lib_class_STM32F4_spi.h"
#include "lib_grafx.h"
#include "bsp.h"

//-------------------------------------------------------------------------------------------------
// define(s)
//-------------------------------------------------------------------------------------------------



#define GRAFX_HSYNC                    ((uint16_t)9)    // Horizontal synchronization
#define GRAFX_HBP                      ((uint16_t)20)   // Horizontal back porch
#define GRAFX_HFP                      ((uint16_t)10)   // Horizontal front porch
#define GRAFX_VSYNC                    ((uint16_t)1)    // Vertical synchronization
#define GRAFX_VBP                      ((uint16_t)2)    // Vertical back porch
#define GRAFX_VFP                      ((uint16_t)4)    // Vertical front porch

#define GRAFX_PLLSAIN_VALUE            192
#define GRAFX_PLLSAIR_VALUE            5
#define GRAFX_PLLSAIQ_VALUE            7

//#define GRAFX_BL_PORT                  GPIOK
//#define GRAFX_BL_PIN                   GPIO_PIN_3

//#define GRAFX_DISPLAY_PORT             GPIOI
//#define GRAFX_DISPLAY_PIN              GPIO_PIN_12

// LTDC define missing in ST Lib
#define LTDC_Pixelformat_L4     8
#define LTDC_Pixelformat_A8     9
#define LTDC_Pixelformat_A4     10

//
//  LCD Registers
//
#define DRV_LCD_SLEEP_OUT            0x11   // Sleep Out
#define DRV_LCD_GAMMA                0x26   // Gamma
#define DRV_LCD_DISPLAY_OFF          0x28   // Display Off
#define DRV_LCD_DISPLAY_ON           0x29   // Display On
#define DRV_LCD_COLUMN_ADDR          0x2A   // Column Address
#define DRV_LCD_PAGE_ADDR            0x2B   // Page Address
#define DRV_LCD_GRAM                 0x2C   // GRAM
#define DRV_LCD_MAC                  0x36   // Memory Access Control
#define DRV_LCD_PIXEL_FORMAT         0x3A   // Pixel Format
#define DRV_LCD_WDB                  0x51   // Write Brightness Display
#define DRV_LCD_WCD                  0x53   // Write Control Display
#define DRV_LCD_RGB_INTERFACE        0xB0   // RGB Interface Signal Control
#define DRV_LCD_FRC                  0xB1   // Frame Rate Control
#define DRV_LCD_BPC                  0xB5   // Blanking Porch Control
#define DRV_LCD_DFC                  0xB6   // Display Function Control
#define DRV_LCD_POWER1               0xC0   // Power Control 1
#define DRV_LCD_POWER2               0xC1   // Power Control 2
#define DRV_LCD_VCOM1                0xC5   // VCOM Control 1
#define DRV_LCD_VCOM2                0xC7   // VCOM Control 2
#define DRV_LCD_0xCA                 0xCA   // Not described in datasheet
#define DRV_LCD_POWERA               0xCB   // Power Control A
#define DRV_LCD_POWERB               0xCF   // Power Control B
#define DRV_LCD_PGAMMA               0xE0   // Positive Gamma Correction
#define DRV_LCD_NGAMMA               0xE1   // Negative Gamma Correction
#define DRV_LCD_DTCA                 0xE8   // Driver Timing Control
#define DRV_LCD_DTCB                 0xEA   // Driver Timing Control
#define DRV_LCD_POWER_SEQ            0xED   // Power On Sequence
#define DRV_LCD_3GAMMA_EN            0xF2   // 3 Gamma Enable
#define DRV_LCD_INTERFACE            0xF6   // Interface Control
#define DRV_LCD_PRC                  0xF7   // Pump Ratio Control

//-------------------------------------------------------------------------------------------------
// Forward Declaration
//-------------------------------------------------------------------------------------------------

//static void     DRV_Line                       (uint16_t PosX, uint16_t PosY, uint16_t Length, uint16_t ThickNess, DrawMode_e Direction);
static void     DRV_IO_Initialize                   (void);     // Initialize the IO on the processor
static void     DRV_LCD_ControllerInitialize        (void);     // LCD is equipped with a IL9341 controller
static void     DRV_LTDC_Initialize                 (void);     // Initialize the in processor LCD controller
static void     DRV_LAYER_Initialize                (void);
static void     DRV_WriteCommand                    (uint8_t Register);
static void     DRV_WriteData                       (uint8_t Value);

//-------------------------------------------------------------------------------------------------
// private const(s)
//-------------------------------------------------------------------------------------------------

static const LTDC_Layer_TypeDef* DRV_LTDC_baLayer[GRAFX_NUMBER_OF_ACTIVE_LAYER] =
{
    LTDC_Layer1,
    LTDC_Layer2
};
static const uint32_t DRV_PixelFormatTable[GRAFX_PIXEL_FORMAT_COUNT] =
{
    LTDC_Pixelformat_ARGB8888,
    LTDC_Pixelformat_RGB888,
    LTDC_Pixelformat_RGB565,
    LTDC_Pixelformat_ARGB1555,
    LTDC_Pixelformat_ARGB4444,
    LTDC_Pixelformat_L8,
    LTDC_Pixelformat_AL44,
    LTDC_Pixelformat_AL88,
    0,
    0,
    0,
};

//-------------------------------------------------------------------------------------------------
// private variable(s)
//-------------------------------------------------------------------------------------------------

DRV_Info_t* DRV_pInfo;

//-------------------------------------------------------------------------------------------------
// Private Function(s)
//-------------------------------------------------------------------------------------------------

//-------------------------------------------------------------------------------------------------
//
//  Name:           DRV_IO_Initialize
//
//  Parameter(s):   None
//  Return:         None
//
//  Description:    GPIO configuration specific for the LCD and processor used by this driver
//
//  Note(s):
//
//-------------------------------------------------------------------------------------------------
static void DRV_IO_Initialize(void)
{
    GPIO_InitTypeDef GPIO_InitStruct;

    // Enable GPIOA, GPIOI, GPIOJ, GPIOJ AHB Clocks
    RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOA |
                           RCC_AHB1Periph_GPIOB |
                           RCC_AHB1Periph_GPIOC |
                           RCC_AHB1Periph_GPIOD |
                           RCC_AHB1Periph_GPIOF |
                           RCC_AHB1Periph_GPIOG, ENABLE);

    // +------------------------+-----------------------+----------------------------+
    // +                       LCD pins assignment                                   +
    // +------------------------+-----------------------+----------------------------+
    // |  LCD_TFT R2 <-> PC.10  |  LCD_TFT G2 <-> PA.06 |  LCD_TFT B2 <-> PD.06      |
    // |  LCD_TFT R3 <-> PB.00  |  LCD_TFT G3 <-> PG.10 |  LCD_TFT B3 <-> PG.11      |
    // |  LCD_TFT R4 <-> PA.11  |  LCD_TFT G4 <-> PB.10 |  LCD_TFT B4 <-> PG.12      |
    // |  LCD_TFT R5 <-> PA.12  |  LCD_TFT G5 <-> PB.11 |  LCD_TFT B5 <-> PA.03      |
    // |  LCD_TFT R6 <-> PB.01  |  LCD_TFT G6 <-> PC.07 |  LCD_TFT B6 <-> PB.08      |
    // |  LCD_TFT R7 <-> PG.06  |  LCD_TFT G7 <-> PD.03 |  LCD_TFT B7 <-> PB.09      |
    // -------------------------------------------------------------------------------
    // |  LCD_TFT HSYNC <-> PC.06  | LCDTFT VSYNC <->  PA.04 |
    // |  LCD_TFT CLK   <-> PG.07  | LCD_TFT DE   <->  PF.10 |
    // |  LCD_TFT C/D   <-> PD.13  |                         |
    // -------------------------------------------------------

    // ---- GPIOs Configuration ----

