aroyer-qc/GRBL_Digini_STM32Fx/module/Digini/Grafx/src/driver/STM32F4xx/lib_STM32F4_lcd_240x320.cpp
    // GPIOs All other pin are configure the same
    GPIO_InitStruct.GPIO_OType = GPIO_OType_PP;
    GPIO_InitStruct.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStruct.GPIO_Mode  = GPIO_Mode_AF;
    GPIO_InitStruct.GPIO_PuPd  = GPIO_PuPd_NOPULL;

    // GPIOA configuration
    GPIO_PinAFConfig(GPIOA, GPIO_PinSource3, GPIO_AF_LTDC);
    GPIO_PinAFConfig(GPIOA, GPIO_PinSource4, GPIO_AF_LTDC);
    GPIO_PinAFConfig(GPIOA, GPIO_PinSource6, GPIO_AF_LTDC);
    GPIO_PinAFConfig(GPIOA, GPIO_PinSource11, GPIO_AF_LTDC);
    GPIO_PinAFConfig(GPIOA, GPIO_PinSource12, GPIO_AF_LTDC);
    GPIO_InitStruct.GPIO_Pin = GPIO_Pin_3 | GPIO_Pin_4 | GPIO_Pin_6 | GPIO_Pin_11 | GPIO_Pin_12;
    GPIO_Init(GPIOA, &GPIO_InitStruct);

    // GPIOB configuration
    GPIO_PinAFConfig(GPIOB, GPIO_PinSource0,  9); //GPIO_AF_LTDC);
    GPIO_PinAFConfig(GPIOB, GPIO_PinSource1,  9);//GPIO_AF_LTDC);
    GPIO_PinAFConfig(GPIOB, GPIO_PinSource8,  GPIO_AF_LTDC);
    GPIO_PinAFConfig(GPIOB, GPIO_PinSource9,  GPIO_AF_LTDC);
    GPIO_PinAFConfig(GPIOB, GPIO_PinSource10,  GPIO_AF_LTDC);
    GPIO_PinAFConfig(GPIOB, GPIO_PinSource11,  GPIO_AF_LTDC);
    GPIO_InitStruct.GPIO_Pin = GPIO_Pin_0 | GPIO_Pin_1 | GPIO_Pin_8 | GPIO_Pin_9 | GPIO_Pin_10 | GPIO_Pin_11;
    GPIO_Init(GPIOB, &GPIO_InitStruct);

    // GPIOC configuration
    GPIO_PinAFConfig(GPIOC, GPIO_PinSource6,  GPIO_AF_LTDC);
    GPIO_PinAFConfig(GPIOC, GPIO_PinSource7,  GPIO_AF_LTDC);
    GPIO_PinAFConfig(GPIOC, GPIO_PinSource10,  GPIO_AF_LTDC);
    GPIO_InitStruct.GPIO_Pin = GPIO_Pin_6 | GPIO_Pin_7 | GPIO_Pin_10;
    GPIO_Init(GPIOC, &GPIO_InitStruct);

    // GPIOD configuration
    GPIO_PinAFConfig(GPIOD, GPIO_PinSource3,  GPIO_AF_LTDC);
    GPIO_PinAFConfig(GPIOD, GPIO_PinSource6,  GPIO_AF_LTDC);
    GPIO_InitStruct.GPIO_Pin = GPIO_Pin_3 | GPIO_Pin_6;
    GPIO_Init(GPIOD, &GPIO_InitStruct);

    // GPIOF configuration
    GPIO_PinAFConfig(GPIOF, GPIO_PinSource10, GPIO_AF_LTDC);
    GPIO_InitStruct.GPIO_Pin = GPIO_Pin_10;
    GPIO_Init(GPIOF, &GPIO_InitStruct);

    // GPIOG configuration
    GPIO_PinAFConfig(GPIOG, GPIO_PinSource6,  GPIO_AF_LTDC);
    GPIO_PinAFConfig(GPIOG, GPIO_PinSource7,  GPIO_AF_LTDC);
    GPIO_PinAFConfig(GPIOG, GPIO_PinSource10,  9);//GPIO_AF_LTDC);
    GPIO_PinAFConfig(GPIOG, GPIO_PinSource11,  GPIO_AF_LTDC);
    GPIO_PinAFConfig(GPIOG, GPIO_PinSource12,  9);//GPIO_AF_LTDC);
    GPIO_InitStruct.GPIO_Pin = GPIO_Pin_6 | GPIO_Pin_7 | GPIO_Pin_10 | GPIO_Pin_11 | GPIO_Pin_12;
    GPIO_Init(GPIOG, &GPIO_InitStruct);

    // The following pin are output
    GPIO_InitStruct.GPIO_Mode = GPIO_Mode_OUT;

    // Port C pin 2 is a simple output to control CS on SPI interface
    GPIO_InitStruct.GPIO_Pin = GPIO_Pin_2;
    GPIO_Init(GPIOC, &GPIO_InitStruct);
    GPIO_WriteBit(GPIOC, GPIO_Pin_2, Bit_SET);

    // Port D pin 13 is a simple output to control C/D pin on LCD
    GPIO_InitStruct.GPIO_Pin = GPIO_Pin_13;
    GPIO_Init(GPIOD, &GPIO_InitStruct);
}


//-------------------------------------------------------------------------------------------------
//
//  Name:           DRV_LCD_ControllerInitialize
//
//  Parameter(s):   None
//  Return:         None
//
//  Description:    LCD is equipped with a IL9341 controller that need to be initialize
//
//  Note(s):
//
//-------------------------------------------------------------------------------------------------
static void DRV_LCD_ControllerInitialize(void)
{
    // Take the mutex
    DRV_pInfo->pSPI->LockToDevice(DRV_pInfo->pDeviceInfo);

    DRV_WriteCommand(DRV_LCD_0xCA);
    DRV_WriteData(0xC3);
    DRV_WriteData(0x08);
    DRV_WriteData(0x50);
    DRV_WriteCommand(DRV_LCD_POWERB);
    DRV_WriteData(0x00);
    DRV_WriteData(0xC1);
    DRV_WriteData(0x30);
    DRV_WriteCommand(DRV_LCD_POWER_SEQ);
    DRV_WriteData(0x64);
    DRV_WriteData(0x03);
    DRV_WriteData(0x12);
    DRV_WriteData(0x81);
    DRV_WriteCommand(DRV_LCD_DTCA);
    DRV_WriteData(0x85);
    DRV_WriteData(0x00);
    DRV_WriteData(0x78);
    DRV_WriteCommand(DRV_LCD_POWERA);
    DRV_WriteData(0x39);
    DRV_WriteData(0x2C);
    DRV_WriteData(0x00);
    DRV_WriteData(0x34);
    DRV_WriteData(0x02);
    DRV_WriteCommand(DRV_LCD_PRC);
    DRV_WriteData(0x20);
    DRV_WriteCommand(DRV_LCD_DTCB);
    DRV_WriteData(0x00);
    DRV_WriteData(0x00);
    DRV_WriteCommand(DRV_LCD_FRC);
    DRV_WriteData(0x00);
    DRV_WriteData(0x1B);
    DRV_WriteCommand(DRV_LCD_DFC);
    DRV_WriteData(0x0A);
    DRV_WriteData(0xA2);
    DRV_WriteCommand(DRV_LCD_POWER1);
    DRV_WriteData(0x10);
    DRV_WriteCommand(DRV_LCD_POWER2);
    DRV_WriteData(0x10);
    DRV_WriteCommand(DRV_LCD_VCOM1);
    DRV_WriteData(0x45);
    DRV_WriteData(0x15);
    DRV_WriteCommand(DRV_LCD_VCOM2);
    DRV_WriteData(0x90);
    DRV_WriteCommand(DRV_LCD_MAC);
    DRV_WriteData(0xC8);
    DRV_WriteCommand(DRV_LCD_3GAMMA_EN);
    DRV_WriteData(0x00);
    DRV_WriteCommand(DRV_LCD_RGB_INTERFACE);
    DRV_WriteData(0xC2);
    DRV_WriteCommand(DRV_LCD_DFC);
    DRV_WriteData(0x0A);
    DRV_WriteData(0xA7);
    DRV_WriteData(0x27);
    DRV_WriteData(0x04);

    // column address set
    DRV_WriteCommand(DRV_LCD_COLUMN_ADDR);
    DRV_WriteData(0x00);
    DRV_WriteData(0x00);
    DRV_WriteData(0x00);
    DRV_WriteData(0xEF);

    // Page Address Set
    DRV_WriteCommand(DRV_LCD_PAGE_ADDR);
    DRV_WriteData(0x00);
    DRV_WriteData(0x00);
    DRV_WriteData(0x01);
    DRV_WriteData(0x3F);
    DRV_WriteCommand(DRV_LCD_INTERFACE);
    DRV_WriteData(0x01);
    DRV_WriteData(0x00);
    DRV_WriteData(0x06);

    DRV_WriteCommand(DRV_LCD_GRAM);
    BSP_Delay_uSec(200);

    DRV_WriteCommand(DRV_LCD_GAMMA);
    DRV_WriteData(0x01);

    DRV_WriteCommand(DRV_LCD_PGAMMA);
    DRV_WriteData(0x0F);
    DRV_WriteData(0x29);
    DRV_WriteData(0x24);
    DRV_WriteData(0x0C);
    DRV_WriteData(0x0E);
    DRV_WriteData(0x09);
    DRV_WriteData(0x4E);
    DRV_WriteData(0x78);
    DRV_WriteData(0x3C);
    DRV_WriteData(0x09);
    DRV_WriteData(0x13);
    DRV_WriteData(0x05);
    DRV_WriteData(0x17);
    DRV_WriteData(0x11);
    DRV_WriteData(0x00);
    DRV_WriteCommand(DRV_LCD_NGAMMA);
    DRV_WriteData(0x00);
    DRV_WriteData(0x16);
    DRV_WriteData(0x1B);
    DRV_WriteData(0x04);
    DRV_WriteData(0x11);
    DRV_WriteData(0x07);
    DRV_WriteData(0x31);
    DRV_WriteData(0x33);
    DRV_WriteData(0x42);
    DRV_WriteData(0x05);
    DRV_WriteData(0x0C);
    DRV_WriteData(0x0A);
    DRV_WriteData(0x28);
    DRV_WriteData(0x2F);
    DRV_WriteData(0x0F);

    DRV_WriteCommand(DRV_LCD_SLEEP_OUT);
    BSP_Delay_uSec(200);
    DRV_WriteCommand(DRV_LCD_DISPLAY_ON);

    // GRAM start writing
    DRV_WriteCommand(DRV_LCD_GRAM);

  //  DRV_WriteCommand(DRV_LCD_DISPLAY_ON);

    DRV_pInfo->pSPI->UnlockFromDevice(DRV_pInfo->pDeviceInfo);
}

//-------------------------------------------------------------------------------------------------
//
//  Name:           DRV_LCD_ControllerInitialize
//
//  Parameter(s):   None
//  Return:         None
//
//  Description:    Initialize the processor built-in LCD controller
//  Note(s):
//
//-------------------------------------------------------------------------------------------------
static void DRV_LTDC_Initialize(void)
{
    LTDC_InitTypeDef LTDC_InitStruct;

    RCC_APB2PeriphClockCmd(RCC_APB2Periph_LTDC, ENABLE);        // Enable the LTDC Clock
    RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_DMA2D, ENABLE);       // Enable the DMA2D Clock for transfer

  // ---- Enable Pixel Clock ----
    // Configure PLLSAI prescalers for LCD
    // PLLSAI_VCO Input                                             = 1 MHz
    // PLLSAI_VCO Output    = PLLSAI_VCO Input * PLLSAI_N  = 1*192  = 192 MHz
    // PLLLCDCLK            = PLLSAI_VCO Output/PLLSAI_R   = 192/3  = 64 MHz
    // LTDC clock frequency = PLLLCDCLK / RCC_PLLSAIDivR   = 64/8   = 8.0 MHz
    RCC_PLLSAIConfig(192, 7, 4);
    RCC_LTDCCLKDivConfig(RCC_PLLSAIDivR_Div8);

    RCC_PLLSAICmd(ENABLE);                                                                          // Enable PLLSAI Clock
    while(RCC_GetFlagStatus(RCC_FLAG_PLLSAIRDY) == RESET){};                                        // Wait for PLLSAI activation

