aroyer-qc/GRBL_Digini_STM32Fx/module/Digini/Grafx/src/driver/STM32F4xx/lib_STM32F4_lcd_240x320.cpp
    // configure timer
     // BP = back porch, FP = front porch
     //
     // HSync = 10       VSync = 2
     // HBP   = 20       VBP   = 2
     // HFP   = 10       VFP   = 4
     //
     // portrait mode: W = 240, H = 320
     //
    LTDC_StructInit (&LTDC_InitStruct);

    // ---- LTDC Initialization ----

    LTDC_InitStruct.LTDC_HSPolarity = LTDC_HSPolarity_AL;                                           // Initialize the horizontal synchronization polarity as active low
    LTDC_InitStruct.LTDC_VSPolarity = LTDC_VSPolarity_AL;                                           // Initialize the vertical synchronization polarity as active low
    LTDC_InitStruct.LTDC_DEPolarity = LTDC_DEPolarity_AL;                                           // Initialize the data enable polarity as active low
    LTDC_InitStruct.LTDC_PCPolarity = LTDC_PCPolarity_IPC;                                          // Initialize the pixel clock polarity as input pixel clock

    // Timing configuration
    LTDC_InitStruct.LTDC_HorizontalSync     = GRAFX_HSYNC;                                          // Configure horizontal synchronization width
    LTDC_InitStruct.LTDC_VerticalSync       = GRAFX_VSYNC;                                          // Configure vertical synchronization height
    LTDC_InitStruct.LTDC_AccumulatedHBP     = GRAFX_HSYNC + GRAFX_HBP;                              // Configure accumulated horizontal back porch
    LTDC_InitStruct.LTDC_AccumulatedVBP     = GRAFX_VSYNC + GRAFX_VBP;                              // Configure accumulated vertical back porch
    LTDC_InitStruct.LTDC_AccumulatedActiveW = GRAFX_HSYNC + GRAFX_HBP + GRAFX_SIZE_X;               // Configure accumulated active width
    LTDC_InitStruct.LTDC_AccumulatedActiveH = GRAFX_VSYNC + GRAFX_VBP + GRAFX_SIZE_Y;               // Configure accumulated active height
    LTDC_InitStruct.LTDC_TotalWidth         = GRAFX_HSYNC + GRAFX_HBP + GRAFX_SIZE_X + GRAFX_HFP;   // Configure total width
    LTDC_InitStruct.LTDC_TotalHeigh         = GRAFX_VSYNC + GRAFX_VBP + GRAFX_SIZE_Y + GRAFX_VFP;   // Configure total height

    // Configure R,G,B component values for LCD background color
    LTDC_InitStruct.LTDC_BackgroundRedValue   = 0;
    LTDC_InitStruct.LTDC_BackgroundGreenValue = 0;
    LTDC_InitStruct.LTDC_BackgroundBlueValue  = 0;

    LTDC_Init(&LTDC_InitStruct);                                                                    // Initialize LTDC
}


//-------------------------------------------------------------------------------------------------
//
//  Name:           DRV_LayerConfig
//
//  Parameter(s):   CLayer* pLayer
//  Return:         None
//
//  Description:    Configuration for layer
//
//  Note(s):
//
//-------------------------------------------------------------------------------------------------
static void DRV_LAYER_Initialize(void)
{
    DRV_LayerConfig(&LayerTable[BACKGROUND_DISPLAY_LAYER_0]);
    DRV_LayerConfig(&LayerTable[FOREGROUND_DISPLAY_LAYER_0]);
}


//-------------------------------------------------------------------------------------------------
//
//   Function name: WriteCommand
//
//   Parameter(s):  uint8_t         Register
//   Return value:  DRESULT
//
//   Description:   Write to Register
//
//   Note(s):
//
//-------------------------------------------------------------------------------------------------
static void DRV_WriteCommand(uint8_t Register)
{
    GPIO_WriteBit(GPIOD, GPIO_Pin_13, Bit_RESET);   // Reset C/D to send command
    GPIO_WriteBit(GPIOC, GPIO_Pin_2, Bit_RESET);    // Reset the CS
    DRV_pInfo->pSPI->Write(Register);
    GPIO_WriteBit(GPIOC, GPIO_Pin_2, Bit_SET);      // Set the CS
}


//-------------------------------------------------------------------------------------------------
//
//   Function name: WriteData
//
//   Parameter(s):  uint8_t         Register
//   Return value:  DRESULT
//
//   Description:   Write to Register
//
//   Note(s):
//
//-------------------------------------------------------------------------------------------------
static void DRV_WriteData(uint8_t Value)
{
    GPIO_WriteBit(GPIOD, GPIO_Pin_13, Bit_SET);    // Set the C/D to send data
    GPIO_WriteBit(GPIOC, GPIO_Pin_2, Bit_RESET);   // Set the CS
    DRV_pInfo->pSPI->Write(Value);
    GPIO_WriteBit(GPIOC, GPIO_Pin_2, Bit_SET);     // Set the CS
}


//-------------------------------------------------------------------------------------------------
// Global Function(s)
//-------------------------------------------------------------------------------------------------

//-------------------------------------------------------------------------------------------------
//
//  Name:           Initialize
//
//  Parameter(s):   void* Arg           ( to pass any kind data the driver might need
//  Return:         None
//
//  Description:    LCD configuration specific for the LCD and processor used by this driver
//
//  Note(s):
//
//-------------------------------------------------------------------------------------------------

void DRV_Initialize(void* pArg)
{
    DRV_pInfo = (DRV_Info_t*)pArg;

    DRV_pInfo->pSPI->Initialize();
    DRV_IO_Initialize();                    // Initialize the IO on the processor
    DRV_LCD_ControllerInitialize();         // LCD is equipped with a IL9341 controller
    DRV_LTDC_Initialize();                  // Initialize the in processor LCD controller
    DRV_LAYER_Initialize();
}


//-------------------------------------------------------------------------------------------------
//
//  Name:           DRV_LayerConfig
//
//  Parameter(s):   CLayer* pLayer
//  Return:         None
//
//  Description:    Configuration for layer
//
//  Note(s):
//
//-------------------------------------------------------------------------------------------------
void DRV_LayerConfig(CLayer* pLayer)
{
    LTDC_Layer_InitTypeDef      LTDC_LayerInitStruct;
    uint8_t                     PixelSize;
    LTDC_Layer_TypeDef*         LTDC_pSelectedLayer;
    LayerType_e                 ActiveLayer;

    ActiveLayer = pLayer->GetActive();

    if(ActiveLayer < GRAFX_NUMBER_OF_ACTIVE_LAYER)
    {
        LTDC_pSelectedLayer = (LTDC_Layer_TypeDef*)DRV_LTDC_baLayer[ActiveLayer];
        PixelSize           = pLayer->GetPixelSize();

        //      Windowing configuration
        //          All the active display area is used to display
        //          Horizontal start = horizontal synchronization + Horizontal back porch + 1
        //          Horizontal stop  = Horizontal start + window width
        //          Vertical start   = vertical synchronization + vertical back porch + 1
        //          Vertical stop    = Vertical start + window height
        LTDC_LayerInitStruct.LTDC_HorizontalStart   = GRAFX_HSYNC + GRAFX_HBP + 1;
        LTDC_LayerInitStruct.LTDC_HorizontalStop    = GRAFX_HSYNC + GRAFX_HBP + GRAFX_SIZE_X;
        LTDC_LayerInitStruct.LTDC_VerticalStart     = GRAFX_VSYNC + GRAFX_VBP + 1;
        LTDC_LayerInitStruct.LTDC_VerticalStop      = GRAFX_VSYNC + GRAFX_VBP + GRAFX_SIZE_Y;
        LTDC_LayerInitStruct.LTDC_PixelFormat       = DRV_PixelFormatTable[pLayer->GetPixelFormat()];      // Pixel Format configuration
        LTDC_LayerInitStruct.LTDC_ConstantAlpha     = (uint32_t)pLayer->GetAlpha();                        // Alpha constant (255 totally opaque)
        LTDC_LayerInitStruct.LTDC_BlendingFactor_1  = LTDC_BlendingFactor1_PAxCA;                          // Configure blending factors
        LTDC_LayerInitStruct.LTDC_BlendingFactor_2  = LTDC_BlendingFactor2_PAxCA;
        LTDC_LayerInitStruct.LTDC_DefaultColorBlue  = 0;                                                   // Default Color configuration (configure A,R,G,B component values)
        LTDC_LayerInitStruct.LTDC_DefaultColorGreen = 0;
        LTDC_LayerInitStruct.LTDC_DefaultColorRed   = 0;
        LTDC_LayerInitStruct.LTDC_DefaultColorAlpha = 0;
        LTDC_LayerInitStruct.LTDC_CFBStartAdress    = pLayer->GetAddress();                                // Input Address configuration

